Revit 2027 API
Form.AddProfile Method
Add a profile into the form, by a specified edge/param.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AddProfile(
	Reference edgeReference,
	double param
)
Public Function AddProfile (
	edgeReference As Reference,
	param As Double
) As Integer
public:
int AddProfile(
	Reference^ edgeReference,
	double param
)
member AddProfile :
        edgeReference : Reference *
        param : float -> int
Parameters
edgeReference Reference
The geometry reference of edge.
param Double
The param on edge to specify the location.
Return Value
Int32
Index of newly created profile.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace